# 01. Importing libraries and data sets

Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

creating a path

In [2]:
path = r'C:\Users\chris\Desktop\Upskilling\CareerFoundry\Data Immersion\Achievement 4\08-2025 Instacart Basket Analysis'

Importing data sets

In [5]:
df_ords = pd.read_csv(os.path.join(path, '02. Data', 'Prepared Data', 'order_checked.csv'), index_col = False)

In [6]:
df_ords_prior = pd.read_csv(os.path.join(path, '02. Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

checking the dataframes

In [7]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [9]:
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,0,2539329,1,prior,1,2,8,0.0,yes
1,1,1,2398795,1,prior,2,3,7,15.0,no
2,2,2,473747,1,prior,3,3,12,21.0,no
3,3,3,2254736,1,prior,4,4,7,29.0,no
4,4,4,431534,1,prior,5,4,15,28.0,no

identifying columns

In [16]:
df_ords.columns

Index(['Unnamed: 0.1', 'Unnamed: 0', 'order_id', 'user_id', 'eval_set',
       'order_number', 'orders_day_of_week', 'order_hour_of_day',
       'days_since_prior_order', 'first_order'],
      dtype='object')

removing unwanted columns

In [17]:
df_ords = df_ords.drop(['Unnamed: 0.1', 'Unnamed: 0', 'eval_set'], axis=1)

In [18]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,1,2,8,0.0,yes
1,2398795,1,2,3,7,15.0,no
2,473747,1,3,3,12,21.0,no
3,2254736,1,4,4,7,29.0,no
4,431534,1,5,4,15,28.0,no

Checking the shape of the dataframes

In [21]:
df_ords.shape

(3421083, 7)

In [22]:
df_ords_prior.shape

(32434489, 4)

Merging the two df using merge function

In [23]:
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [24]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,0.0,yes,196,1,0,both
1,2539329,1,1,2,8,0.0,yes,14084,2,0,both
2,2539329,1,1,2,8,0.0,yes,12427,3,0,both
3,2539329,1,1,2,8,0.0,yes,26088,4,0,both
4,2539329,1,1,2,8,0.0,yes,26405,5,0,both

In [25]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

Exporting files as CSV and Pickle

In [28]:
df_merged_large.to_csv(os.path.join(path, '02. Data','Prepared Data', 'orders_products_combined.csv'))

In [29]:
df_merged_large.to_pickle(os.path.join(path, '02. Data','Prepared Data', 'orders_products_combined.pkl'))

Extra reading/info on merging:
https://www.dataquest.io/blog/pandas-concatenation-tutorial/